podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/LLWU_ME_PE4_FILT2_RST_MK20D5.svd.xml
<!--
Devices using this peripheral: 
      MK20D5
      MK64F12
-->
      <peripheral>
         <?sourceFile "LLWU_ME_PE4_FILT2_RST_MK20D5" ?>
         <name>LLWU</name>
         <description>Low leakage wakeup unit</description>
         <groupName>LLWU</groupName>
         <headerStructName>LLWU</headerStructName>
         <baseAddress>0x4007C000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0xB</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>4</dim>
               <dimIncrement>1</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>PE%s</name>
               <?hide?>
               <description>Pin Enable %s Register\n
Enables and selects the edge detect type for the external wakeup input pins LLWU_x</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUPE0</name>
                     <description>Pin Enable 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Rising edge</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Falling edge</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Any edge</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUPE0" > <name>WUPE1</name> <description>Pin Enable 1</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUPE0" > <name>WUPE2</name> <description>Pin Enable 2</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUPE0" > <name>WUPE3</name> <description>Pin Enable 3</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PE1</name>
               <description>Pin Enable 1 Register\n
Enables and selects the edge detect type for the external wakeup input pins LLWU_P3-LLWU_P0</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUPE0</name>
                     <description>Pin Enable 0 - PTE1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Rising edge</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Falling edge</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Any edge</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUPE0" > <name>WUPE1</name> <description>Pin Enable 1 - PTE2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUPE0" > <name>WUPE2</name> <description>Pin Enable 2 - PTE4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUPE0" > <name>WUPE3</name> <description>Pin Enable 3 - PTA4</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PE2</name>
               <description>Pin Enable 2 Register\n
Enables and selects the edge detect type for the external wakeup input pins LLWU_P7-LLWU_P4</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUPE4</name>
                     <description>Pin Enable 4 - PTA13</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Rising edge</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Falling edge</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Any edge</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUPE4" > <name>WUPE5</name> <description>Pin Enable 5 - PTB0</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUPE4" > <name>WUPE6</name> <description>Pin Enable 6 - PTC1</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUPE4" > <name>WUPE7</name> <description>Pin Enable 7 - PTC3</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PE3</name>
               <description>Pin Enable 3 Register\n
Enables and selects the edge detect type for the external wakeup input pins LLWU_P11-LLWU_P8</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUPE8</name>
                     <description>Pin Enable 8 - PTC4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Rising edge</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Falling edge</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Any edge</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUPE8" > <name>WUPE9</name> <description>Pin Enable 9 - PTC5</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUPE8" > <name>WUPE10</name> <description>Pin Enable 10 - PTC6</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUPE8" > <name>WUPE11</name> <description>Pin Enable 11 - PTC11</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PE4</name>
               <description>Pin Enable 4 Register\n
Enables and selects the edge detect type for the external wakeup input pins LLWU_P15-LLWU_P12</description>
               <addressOffset>0x3</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUPE12</name>
                     <description>Pin Enable 12 - PTD0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Rising edge</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Falling edge</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Any edge</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUPE12" > <name>WUPE13</name> <description>Pin Enable 13 - PTD2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUPE12" > <name>WUPE14</name> <description>Pin Enable 14 - PTD4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUPE12" > <name>WUPE15</name> <description>Pin Enable 15 - PTD6</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>ME</name>
               <description>Module Enable Register\n
Enable and selects the internal module flag as a wakeup input source for inputs MWUF7-MWUF0</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUME0</name>
                     <description>Module Enable 0 - LPTMR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUME0" > <name>WUME1</name> <description>Module Enable 1 - CMP0</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="WUME0" > <name>WUME2</name> <description>Module Enable 2 - CMP1</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUME0" > <name>WUME3</name> <description>Module Enable 3 - Reserved</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="WUME0" > <name>WUME4</name> <description>Module Enable 4 - TSI</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUME0" > <name>WUME5</name> <description>Module Enable 5 - RTC Alarm</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="WUME0" > <name>WUME6</name> <description>Module Enable 6 - Reserved</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="WUME0" > <name>WUME7</name> <description>Module Enable 7 - RTC Seconds</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>1</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>PF%s</name>
               <?hide?>
               <description>Pin Flag %s Register\n
Contains the flags indicating if a wakeup source LLWUx caused the MCU to exit VLLS mode.\n
Write 1 to clear the flag</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUF0</name>
                     <description>Wakeup flag for pin 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not wakeup source</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Is wakeup source</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUF0" > <name>WUF1</name> <description>Wakeup flag for pin 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="WUF0" > <name>WUF2</name> <description>Wakeup flag for pin 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUF0" > <name>WUF3</name> <description>Wakeup flag for pin 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="WUF0" > <name>WUF4</name> <description>Wakeup flag for pin 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUF0" > <name>WUF5</name> <description>Wakeup flag for pin 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="WUF0" > <name>WUF6</name> <description>Wakeup flag for pin 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="WUF0" > <name>WUF7</name> <description>Wakeup flag for pin 7</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PF1</name>
               <description>Pin Flag 1 Register\n
Contains the flags indicating if a wakeup source LLWU 7-0 caused the MCU to exit VLLS mode.\n
Write 1 to clear the flag</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUF0</name>
                     <description>Wakeup flag for PTE1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not wakeup source</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Is wakeup source</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUF0" > <name>WUF1</name> <description>Wakeup flag for PTE2</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="WUF0" > <name>WUF2</name> <description>Wakeup flag for PTE4</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUF0" > <name>WUF3</name> <description>Wakeup flag for PTA4</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="WUF0" > <name>WUF4</name> <description>Wakeup flag for PTA13</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUF0" > <name>WUF5</name> <description>Wakeup flag for PTB0</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="WUF0" > <name>WUF6</name> <description>Wakeup flag for PTC1</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="WUF0" > <name>WUF7</name> <description>Wakeup flag for PTC3</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PF2</name>
               <description>Pin Flag 2 Register\n
Contains the flags indicating if a wakeup source LLWU 15-8 caused the MCU to exit VLLS mode.\n
Write 1 to clear the flag</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUF8</name>
                     <description>Wakeup flag for PTC4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not wakeup source</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Is wakeup source</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUF8" > <name>WUF9</name> <description>Wakeup flag for PTC5</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="WUF8" > <name>WUF10</name> <description>Wakeup flag for PTC6</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUF8" > <name>WUF11</name> <description>Wakeup flag for PTC11</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="WUF8" > <name>WUF12</name> <description>Wakeup flag for PTD0</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUF8" > <name>WUF13</name> <description>Wakeup flag for PTD2</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="WUF8" > <name>WUF14</name> <description>Wakeup flag for PTD4</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="WUF8" > <name>WUF15</name> <description>Wakeup flag for PTD6</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>MF</name>
               <?hide?>
               <description>Module Flag Register\n
Contains the flags indicating if an internal wakeup source caused the MCU to exit VLLS mode.\n
This flag reflects the flag in the related peripheral.\n
To clear this flag it is necessary to clear the flag in the peripheral</description>
               <addressOffset>0x7</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>MWUF0</name>
                     <description>Wakeup flag for LPTMR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not wakeup source</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Is wakeup source</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="MWUF0" > <name>MWUF1</name> <description>Wakeup flag for CMP0</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="MWUF0" > <name>MWUF2</name> <description>Wakeup flag for CMP1</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="MWUF0" > <name>MWUF3</name> <description>Wakeup flag for Reserved_3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="MWUF0" > <name>MWUF4</name> <description>Wakeup flag for TSI</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="MWUF0" > <name>MWUF5</name> <description>Wakeup flag for RTC Alarm</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="MWUF0" > <name>MWUF6</name> <description>Wakeup flag for Reserved_6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="MWUF0" > <name>MWUF7</name> <description>Wakeup flag for RTC Seconds</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
